// **Задание №1**
// Склонировать содержимое моего репозитория,
// поэкспериментировать с гитом, попробовать работу через терминал
// и через VSCode. Домашнее задание выложить в репозиторий и
// ссылку разместить в таблице с ДЗ.

// Репозиторий склонирован. Свой репозиторий создан.

// **Задание №2**
// Установить расширение Prettier для форматирования кода. Сделать
// файл с правилами (можно взять из моего проекта), настроить
// автоматическое форматирование документа при его сохранении.

//Расширение Prettier установлено. Файл с правилами добавлен. Автоматическое форматирование документа при его сохранении
// задействовано в Settigs -> Editor: Format On Save

// **Задание №3​**
// 1. Простые данные
// Задача: В переменной хранится возраст пользователя. Ему может
// быть 0 лет.
// Как назвать переменную?

let userAge;

// **2. Флаги состояния**
// Задача: Нужно отслеживать, авторизован ли пользователь на сайте.
// Как назвать переменную?

let isUserAuthorized;

// **3. Коллекции элементов**
// Задача: В переменной хранится список всех товаров в корзине
// интернет-магазина.
// Как назвать переменную?

let productInBasketList;

// **4. Сложные данные (объект)**
// Задача: В переменной хранится информация о книге: её название,
// автор, год издания и количество страниц.
// Как назвать переменную для всей книги? А для свойств внутри неё?

const book = {
    name: "JavaScript",
    autohr: "Brendan Eich",
    publicationYear: 1995,
    pageCount: 1053,
};

// **5. Вычисляемые значения**
// Задача: В переменную записывается общая сумма всех товаров в
// корзине после применения всех скидок.
// Как назвать переменную?

let productInBasketFinalPrice;

// **6. События и таймеры**
// Задача: В переменной хранится ID таймера, который запускает
// какое-то действие каждые 5 секунд. Эта переменная нужна, чтобы
// позже можно было этот таймер остановить.
// Как назвать переменную?

let timerIdController;

// **7. Элементы DOM**
// Задача: Нужно работать с кнопкой в интерфейсе, при нажатии на
// которую открывается модальное окно.
// Как назвать переменную, которая ссылается на эту HTML-кнопку?

let openModalWindowButton;

// **8. Булевы значения (да/нет)**
// Задача: Переменная отвечает на вопрос: "Отображен ли сейчас
// этот попап на экране?"
// Как назвать переменную?

let isDisplayedPopUp;

// **9. Строки для отображения**
// Задача: В переменной собирается приветственное сообщение для
// пользователя, например, "Добро пожаловать, [Имя]!".
// Как назвать переменную?

let userGreetingMessage;

//**10. Функции-обработчики**
// Задача: Создаётся функция, которая будет вызвана при отправке
// пользователем формы регистрации.
// Как назвать эту функцию?

function processRegistration() {}
